{
  "options": "Настройки",
  "scriptExecTimeDescription": "Минимальное количество миллисекунд, необходимое для выполнения операции в Netscript. Установка слишком низкого значения может привести к снижению производительности, если у вас запущено много сценариев.",
  "scriptExecTime": "Время выполнения .script (мс)",
  "netscriptLogSizeDescription": "Максимальное количество строк, которое может содержать журнал скрипта. Установка слишком большого значения может привести к тому, что игра будет использовать много памяти, если у вас запущено много скриптов.",
  "netscriptLogSize": "Размер журнала Netscript",
  "netscriptPortSizeDescription": "Максимальное количество записей, которые можно записать в порт с помощью функции Netscript write(). Установка слишком высокого значения может привести к тому, что игра будет использовать много памяти.",
  "netscriptPortSize": "Размер порта Netscript",
  "terminalCapacityDescription": "Максимальное количество записей, которые можно записать в терминал. Установка слишком высокого значения может привести к тому, что игра будет использовать много памяти.",
  "terminalCapacity": "Вместимость терминала",
  "autosaveIntervalDescription": "Время (в секундах) между автосохранениями. Установите 0, чтобы отключить автосохранение.",
  "autosaveInterval": "Интервал автосохранения (с)",
  "suppressStoryMessages": "Скрыть сюжетные сообщения",
  "suppressStoryMessagesDescription": "Если это установлено, то любые получаемые вами сообщения не будут отображаться в виде всплывающих окон на экране. Они по-прежнему будут отправляться на ваш домашний компьютер в виде файлов «.msg», и их можно просмотреть с помощью команды терминала «cat».",
  "suppressFactionInvites": "Скрыть приглашения фракций",
  "suppressFactionInvitesDescription": "Если это установлено, то любые приглашения фракции, которые вы получаете, не будут отображаться в виде всплывающих окон на экране. Ваши выдающиеся приглашения во фракции можно просмотреть на странице «Фракции».",
  "suppressTravelConfirmations": "Скрыть подтверждение путешествий",
  "suppressTravelConfirmationsDescription": "Если это установлено, подтверждающее сообщение перед поездкой не будет отображаться. Стоимость поездки будет автоматически вычтена, как только вы нажмете.",
  "suppressAugmentationsConfirmation": "Скрыть подтверждение усилений",
  "suppressAugmentationsConfirmationDescription": "Если это установлено, подтверждающее сообщение перед покупкой усиления не будет отображаться.",
  "suppressTIXMessages": "Скрыть TIX-сообщения",
  "suppressTIXMessagesDescription": "Если это установлено, фондовый рынок никогда не будет создавать никаких всплывающих окон.",
  "suppressBladeburnerPopup": "Скрыть всплывающие уведомления Bladeburner",
  "suppressBladeburnerPopupDescription": "Если это установлено, то при прерывании ваших действий Bladeburner из-за того, что вы заняты чем-то другим, всплывающее сообщение отображаться не будет.",
  "suppressAutoSaveGameToast": "Скрыть всплывающие уведомления об автосохранении игры",
  "suppressAutoSaveGameToastDescription": "Если это установлено, после автосохранения не будет всплывающего уведомления \"Игра сохранена!\".",
  "disableHotkeys": "Отключить горячие клавиши",
  "disableHotkeysDescription": "Если это установлено, то большинство горячих клавиш (сочетаний клавиш) в игре отключены. Сюда входят команды терминала, горячие клавиши для перехода между различными частями игры и горячая клавиша «Сохранить и закрыть (Ctrl + b)» в текстовом редакторе.",
  "disableAsciiArt": "Отключить ascii-арт",
  "disableAsciiArtDescription": "Если это установлено, все изображения ASCII будут отключены.",
  "disableTextEffects": "Отключить текстовые эффекты",
  "disableTextEffectsDescription": "Если это установлено, текстовые эффекты не будут отображаться. Это может помочь, если текст трудно читать в определенных областях.",
  "disableOverviewProgressBars": "Отключить индикаторы прогресса в обзоре персонажа",
  "disableOverviewProgressBarsDescription": "Если это установлено, индикаторы выполнения в обзоре персонажа будут скрыты.",
  "enableBashHotkeys": "Включить горячие клавиши bash",
  "enableBashHotkeysDescription": "Улучшен режим эмуляции Bash. Установка этого значения в 1 включает несколько новых ярлыков и функций терминала, которые больше напоминают настоящую оболочку в стиле Bash. Обратите внимание, что когда этот режим включен, ярлыки браузера по умолчанию переопределяются новыми ярлыками Bash.",
  "useGiBInsteadOfGB": "Использовать ГиБ вместо ГБ",
  "useGiBInsteadOfGBDescription": "Если этот параметр установлен, все ссылки на память будут использовать гигабайты вместо гигабайт в соответствии с IEC 60027-2.",
  "excludeRunningScriptsFromSave": "Исключить запущенные скрипты из сохранения",
  "excludeRunningScriptsFromSaveDescription": "Если это установлено, файл сохранения будет исключать все запущенные скрипты. Это полезно только в том случае, если ваше сохранение сильно отстает. Вам придется перезапускать скрипт каждый раз, когда вы запускаете игру.",
  "timestampFormatDescription": "Команды терминала и записи в журнале будут иметь отметку времени. См. https://date-fns.org/docs/Getting-Started/",
  "timestampFormat": "Формат временной метки",
  "saveGameOnFileSave": "Сохранять игру при сохранении файлов",
  "saveGameOnFileSaveDescription": "Сохранять игру каждый раз, когда файл сохраняется в редакторе скриптов.",
  "localeDescription": "Устанавливает локаль для отображения чисел.",
  "locale": "Локаль  ",
  "originalDeveloper": "Автор идеи",
  "currentMaintainer": "Текущий разработчик",
  "donateDescription": "Сдайте кровь!",
  "saveGame": "Сохранить Игру",
  "exportGameDescription": "Экспортируйте игру в текстовый файл.",
  "exportGame": "Экспортировать игру",
  "importGameDescription": "Импортируйте свою игру из текстового файла.\n                  <br />\n                  Это <strong>заменит</strong> вашу текущую игру. Сначала сделайте резервную копию!",
  "importGame": "Импортировать игру",
  "importGameWarning": "Импорт новой игры <strong>полностью сотрет</strong> текущие данные!<br /><br />Перед импортом обязательно сделайте резервную копию текущего файла сохранения.<br />Файл, который вы пытаетесь импорт кажется допустимым.<br />\n <br />",
  "importGameExportDate": "Дата экспорта файла сохранения: <strong>{date}</strong>\n<br />\n <br />",
  "forceKillAllScriptsDescription": "Принудительно завершить все активные запущенные скрипты на случай, если в игре возникнет ошибка или какая-то непредвиденная проблема. После этого сохраните игру и перезагрузите страницу. Это отличается от обычного уничтожения тем, что обычное уничтожение сообщает сценарию о завершении работы, в то время как принудительное уничтожение просто удаляет ссылки на него (и он должен аварийно завершать работу сам по себе). Это не приведет к удалению файлов на вашем компьютере. Просто принудительно уничтожьте все запущенные экземпляры всех скриптов.",
  "forceKillAllScripts": "Принудительно завершить все активные скрипты",
  "diagnoseFilesDescription": "Если ваш файл сохранения очень большой, вы можете использовать эту кнопку, чтобы просмотреть карту всех файлов на каждом сервере. Будьте осторожны, могут быть спойлеры.",
  "diagnoseFiles": "Проверить файлы",
  "themeEditor": "Редактор тем",
  "styleEditor": "Редактор стилей",
  "reportBug": "Сообщить об ошибке",
  "changelog": "Список изменений",
  "documentation": "Документация",
  "discord": "Discord",
  "reddit": "Reddit",
  "incrementalGamePlaza": "Incremental game plaza"
}
