{
  "options": "Options\n      ",
  "scriptExecTimeDescription": "The minimum number of milliseconds it takes to execute an operation in Netscript. Setting this too\n                    low can result in poor performance if you have many scripts running.\n                  ",
  "scriptExecTime": ".script exec time (ms)",
  "netscriptLogSizeDescription": "The maximum number of lines a script's logs can hold. Setting this too high can cause the game to\n                    use a lot of memory if you have many scripts running.\n                  ",
  "netscriptLogSize": "Netscript log size",
  "netscriptPortSizeDescription": "The maximum number of entries that can be written to a port using Netscript's write() function.\n                    Setting this too high can cause the game to use a lot of memory.\n                  ",
  "netscriptPortSize": "Netscript port size",
  "terminalCapacityDescription": "The maximum number of entries that can be written to the terminal. Setting this too high can cause\n                    the game to use a lot of memory.\n                  ",
  "terminalCapacity": "Terminal capacity",
  "autosaveIntervalDescription": "The time (in seconds) between each autosave. Set to 0 to disable autosave.",
  "autosaveInterval": "Autosave interval (s)",
  "suppressStoryMessages": "Suppress story messages",
  "suppressStoryMessagesDescription": "\n                    If this is set, then any messages you receive will not appear as popups on the screen. They will\n                    still get sent to your home computer as '.msg' files and can be viewed with the 'cat' Terminal\n                    command.\n                  ",
  "suppressFactionInvites": "Suppress faction invites",
  "suppressFactionInvitesDescription": "\n                    If this is set, then any faction invites you receive will not appear as popups on the screen. Your\n                    outstanding faction invites can be viewed in the 'Factions' page.\n                  ",
  "suppressTravelConfirmations": "Suppress travel confirmations",
  "suppressTravelConfirmationsDescription": "\n                    If this is set, the confirmation message before traveling will not show up. You will automatically\n                    be deducted the travel cost as soon as you click.\n                  ",
  "suppressAugmentationsConfirmation": "Suppress augmentations confirmation",
  "suppressAugmentationsConfirmationDescription": "If this is set, the confirmation message before buying augmentation will not show up.",
  "suppressTIXMessages": "Suppress TIX messages",
  "suppressTIXMessagesDescription": "If this is set, the stock market will never create any popup.",
  "suppressBladeburnerPopup": "Suppress bladeburner popup",
  "suppressBladeburnerPopupDescription": "\n                      If this is set, then having your Bladeburner actions interrupted by being busy with something else\n                      will not display a popup message.\n                    ",
  "suppressAutoSaveGameToast": "Suppress Auto-Save Game Toast",
  "suppressAutoSaveGameToastDescription": "If this is set, there will be no \"Game Saved!\" toast appearing after an auto-save.",
  "disableHotkeys": "Disable hotkeys",
  "disableHotkeysDescription": "\n                    If this is set, then most hotkeys (keyboard shortcuts) in the game are disabled. This includes\n                    Terminal commands, hotkeys to navigate between different parts of the game, and the \"Save and Close\n                    (Ctrl + b)\" hotkey in the Text Editor.\n                  ",
  "disableAsciiArt": "Disable ascii art",
  "disableAsciiArtDescription": "If this is set all ASCII art will be disabled.",
  "disableTextEffects": "Disable text effects",
  "disableTextEffectsDescription": "\n                    If this is set, text effects will not be displayed. This can help if text is difficult to read in\n                    certain areas.\n                  ",
  "disableOverviewProgressBars": "Disable Overview Progress Bars",
  "disableOverviewProgressBarsDescription": "If this is set, the progress bars in the character overview will be hidden.",
  "enableBashHotkeys": "Enable bash hotkeys",
  "enableBashHotkeysDescription": "\n                    Improved Bash emulation mode. Setting this to 1 enables several new Terminal shortcuts and features\n                    that more closely resemble a real Bash-style shell. Note that when this mode is enabled, the default\n                    browser shortcuts are overriden by the new Bash shortcuts.\n                  ",
  "useGiBInsteadOfGB": "Use GiB instead of GB",
  "useGiBInsteadOfGBDescription": "\n                    If this is set all references to memory will use GiB instead of GB, in accordance with IEC 60027-2.\n                  ",
  "excludeRunningScriptsFromSave": "Exclude Running Scripts from Save",
  "excludeRunningScriptsFromSaveDescription": "\n                    If this is set, the save file will exclude all running scripts. This is only useful if your save is\n                    lagging a lot. You'll have to restart your script every time you launch the game.\n                  ",
  "timestampFormatDescription": "Terminal commands and log entries will be timestamped. See\n                    https://date-fns.org/docs/Getting-Started/\n                  ",
  "timestampFormat": "Timestamp format: ",
  "saveGameOnFileSave": "Save game on file save",
  "saveGameOnFileSaveDescription": "Save your game any time a file is saved in the script editor.",
  "localeDescription": "Sets the locale for displaying numbers.",
  "locale": "Locale ",
  "originalDeveloper": "Original developer",
  "currentMaintainer": "Current maintainer",
  "donateDescription": "Donate blood!",
  "saveGame": "Save Game",
  "exportGameDescription": "Export your game to a text file.",
  "exportGame": "Export Game",
  "importGameDescription": "Import your game from a text file.\n                  <br />\n                  This will <strong>overwrite</strong> your current game. Back it up first!",
  "importGame": "Import Game",
  "importGameWarning": "Importing a new game will <strong>completely wipe</strong> the current data!\n                  <br />\n                  <br />\n                  Make sure to have a backup of your current save file before importing.\n                  <br />\n                  The file you are attempting to import seems valid.\n                  <br />\n                  <br />",
  "importGameExportDate": "The export date of the save file is <strong>{{date}}</strong>\n                      <br />\n                      <br />",
  "forceKillAllScriptsDescription": "Forcefully kill all active running scripts, in case there is a bug or some unexpected issue with the\n                  game. After using this, save the game and then reload the page. This is different then normal kill in\n                  that normal kill will tell the script to shut down while force kill just removes the references to it\n                  (and it should crash on it's own). This will not remove the files on your computer. Just forcefully\n                  kill all running instance of all scripts.\n                ",
  "forceKillAllScripts": "Force kill all active scripts",
  "diagnoseFilesDescription": "If your save file is extremely big you can use this button to view a map of all the files on every\n                  server. Be careful there might be spoilers.\n                ",
  "diagnoseFiles": "Diagnose files",
  "themeEditor": "Theme editor",
  "styleEditor": "Style editor",
  "reportBug": "Report bug",
  "changelog": "Changelog",
  "documentation": "Documentation",
  "discord": "Discord",
  "reddit": "Reddit",
  "incrementalGamePlaza": "Incremental game plaza"
}
